_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 48, 48, 128)       3328      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 48, 48, 128)       409728    
_________________________________________________________________
batch_normalization_1 (Batch (None, 48, 48, 128)       512       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 24, 24, 128)       0         
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 24, 24, 128)       0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 24, 24, 128)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 24, 24, 256)       819456    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 24, 24, 256)       1638656   
_________________________________________________________________
batch_normalization_2 (Batch (None, 24, 24, 256)       1024      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 12, 12, 256)       0         
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 12, 12, 256)       0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 12, 12, 256)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 12, 12, 512)       1180160   
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 12, 12, 512)       2359808   
_________________________________________________________________
batch_normalization_3 (Batch (None, 12, 12, 512)       2048      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 6, 6, 512)         0         
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 6, 6, 512)         0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 6, 6, 512)         0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 6, 6, 768)         3539712   
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 6, 6, 768)         5309184   
_________________________________________________________________
batch_normalization_4 (Batch (None, 6, 6, 768)         3072      
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 3, 3, 768)         0         
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 3, 3, 768)         0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 3, 3, 768)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 6912)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              7078912   
_________________________________________________________________
batch_normalization_5 (Batch (None, 1024)              4096      
_________________________________________________________________
re_lu_1 (ReLU)               (None, 1024)              0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 1024)              1049600   
_________________________________________________________________
batch_normalization_6 (Batch (None, 1024)              4096      
_________________________________________________________________
re_lu_2 (ReLU)               (None, 1024)              0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 512)               524800    
_________________________________________________________________
batch_normalization_7 (Batch (None, 512)               2048      
_________________________________________________________________
re_lu_3 (ReLU)               (None, 512)               0         
_________________________________________________________________
dropout_7 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 512)               262656    
_________________________________________________________________
batch_normalization_8 (Batch (None, 512)               2048      
_________________________________________________________________
re_lu_4 (ReLU)               (None, 512)               0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 7)                 3591      
=================================================================
Total params: 24,198,535
Trainable params: 24,189,063
Non-trainable params: 9,472
_________________________________________________________________
